public class All {
    public static void main(String[] args) {
        for (int i = 50; i <= 70;i++) {
                if (i % 1 == 0 && i % i == 0){
                    break;
                }
                    System.out.println(i);
                }
            }
        }
/*
Найти среди чисел от 50 до 70 второе простое число (число называют простым,если оно делится без остатка
только на 1 и себя) и завершить цикл с использованием break.
 */
