import java.util.regex.Pattern;

public class Stroka {
    public static void main(String[] args) {
        String str = "Введите с клавиатуры строку. Напишите метод, выполняющий поиск в строке всех тегов абзацев";
        Pattern pattern = Pattern.compile("");


    }

}
/*
Введите с клавиатуры строку. Напишите метод, выполняющий поиск в строке всех тегов абзацев, в том числе тех,
у которых есть параметры, например, <p id=”p1”>, и замену их на простые теги абзацев <p>.
Результат работы метода выведите на экран.
 */